Revit 2027 API
RebarContainerItem.GetHookTypeId Method
 Get the id of the RebarHookType to be applied to the rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetHookTypeId(
	int end
)
Public Function GetHookTypeId (
	end As Integer
) As ElementId
public:
ElementId^ GetHookTypeId(
	int end
)
member GetHookTypeId :
        end : int -> ElementId
Parameters
end Int32
 0 for the start hook, 1 for the end hook.
Return Value
ElementId
 The id of a RebarHookType, or invalidElementId if the rebar has no hook at the specified end.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  end must be 0 or 1.
See Also
Reference
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace